conf/src/Documents/ЭП_КорректировкаВыплатПремий/ЭП_КорректировкаВыплатПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_КорректировкаВыплатПремий</name>
  <registerRecords>AccumulationRegister.ЭП_УчетПремийПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ЭП_УчетПремий</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ЭП_ВидыДокументаВыплатаПремий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПоЭтапу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКоэффициентПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогСУчетомПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СотрудникиПоДокументам</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехническийПроект</name>
      <type>
        <types>CatalogRef.ТехническиеПроекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектныйКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияПоЭтапу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроектнаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СреднийКоэффициентПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.РазделыПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогСУчетомПроектногоКоэффициента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокПЗК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_УчетПремий/ЭП_УчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремий</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/AccumulationRegisters/ЭП_УчетПремийПоДокументам/ЭП_УчетПремийПоДокументам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетПремийПоДокументам</name>
  <resources>
    <name>ОстатокПЗК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроектнаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПремияПоЭтапу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ЭП_ВидыДокументаВыплатаПремий/ЭП_ВидыДокументаВыплатаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭП_ВидыДокументаВыплатаПремий</name>
  <enumValues>
    <name>ВыплатаПоСопровждению</name>
  </enumValues>
  <enumValues>
    <name>ОбычнаяВыплата</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_КорректировкаВыплатПремий/Forms/ФормаПодбораСотрудников/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = Параметры.Проект;
	Дата = Параметры.Дата;
	Ссылка = Параметры.Ссылка;
	ВидДокумента = Параметры.ВидДокумента;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники 

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	НоваяСтрока = ВыбранныеСотрудники.Добавить();
	НоваяСтрока.Сотрудник = Элементы.Сотрудники.ДанныеСтроки(ВыбраннаяСтрока).Сотрудник; 
	
	ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеСотрудники 

&НаКлиенте
Процедура ВыбранныеСотрудникиПриИзменении(Элемент)
	
	ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивСотрудников = Новый Массив;
	Для Каждого Строка Из ВыбранныеСотрудники Цикл;
		МассивСотрудников.Добавить(Строка.Сотрудник);
	КонецЦикла;
	ОповеститьОВыборе(Новый Структура("МассивСотрудников", МассивСотрудников));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокСотрудников()

	Если ВидДокумента = Перечисления.ЭП_ВидыДокументаВыплатаПремий.ОбычнаяВыплата Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭП_УчетПремийОстатки.Пользователь КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ЭП_УчетПремий.Остатки(
		|			&МоментВрем,
		|			Проект = &Проект
		|				И НЕ Пользователь В (&МассивСотрудников)) КАК ЭП_УчетПремийОстатки";
		
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЭП_УчетПремийПоДокументамОстатки.Пользователь КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ЭП_УчетПремийПоДокументам.Остатки(
		|			&МоментВрем,
		|			Проект = &Проект
		|				И НЕ Пользователь В (&МассивСотрудников)) КАК ЭП_УчетПремийПоДокументамОстатки";
		
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	МоментВрем = Новый МоментВремени(Дата, Ссылка);
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("МоментВрем", Новый Граница(МоментВрем, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("МассивСотрудников", ВыбранныеСотрудники.Выгрузить(, "Сотрудник"));
		
	РезультатЗапроса = Запрос.Выполнить();
	МассивСотрудники = Новый Массив();
    Сотрудники.Загрузить(РезультатЗапроса.Выгрузить());


КонецПроцедуры 

&НаСервере
Процедура ПриОткрытииНаСервере()
	
    ОбновитьСписокСотрудников();
	
КонецПроцедуры

#КонецОбласти
